# coding=utf8
import warnings
warnings.filterwarnings(action='ignore', category=UserWarning, module='gensim')
warnings.filterwarnings(action='ignore', category=FutureWarning)

from gensim.models import Word2Vec
from pythainlp.tokenize import word_tokenize , sent_tokenize

text = ["""มองโลกผ่านการจัดหนังสือในห้องสมุดด้วยระบบทศนิยมของดิวอี้

ก่อนอื่นต้องขอออกตัวไว้ก่อนเลยว่า ไม่ใช่บรรณารักษ์ และไม่ได้เรียนมาทางด้านนี้ เป็นเพียงแค่คนธรรมดาที่ชอบอ่านหนังสือชอบเข้าห้องสมุด และเกิดสนใจเรื่องของการจัดหนังสือในห้องสมุดเท่านั้นเอง

ระบบการจัดหนังสือในห้องสมุดนั้นจะว่าไปแล้วนอกจากจะเป็นการจัดหนังสือในห้องสมุดให้เป็นระเบียบเรียบร้อย แยกกันเป็นหมวดหมู่แล้ว ถ้ามองให้ลึกลงไป ก็สามารถจะมองเห็นโลกทัศน์ของผู้คิดระบบได้เหมือนกัน

ระบบทศนิยมของดิวอี้ เป็นระบบการจัดเรียงหนังสือในห้องสมุดที่คิดขึ้นโดยเมลวิน ดิวอี้ (Melvin Dewey) ซึ่งเคยทำงานเป็นบรรณารักษ์ในห้องสมุดแห่งหนึ่งในอเมริกา เมื่อปี 1876 และได้เป็นระบบที่นิยมใช้กันมากที่สุด ในเมืองไทยที่เห็นส่วนใหญ่ก็ใช้ระบบนี้ ไม่ว่าที่หอสมุดแห่งชาติ หอสมุดเมืองและห้องสมุดเพื่อการเรียนรู้ของ กทม. ห้องสมุด กศน. หรือห้องสมุดของ TK park (เอาเท่าที่รู้ ที่อื่นไม่แน่ใจ)

ระบบของดิวอี้จะใช้ตัวเลข 3 หลัก โดยหลักแรกสุดจะเป็นหมวดหลัก มี 10 หมวด คือ 0xx หนังสือทั่วไป 1xx ปรัชญาและจิตวิทยา 2xx ศาสนา 3xx สังคมศาสตร์ 4xx ภาษา 5xx วิทยาศาสตร์บริสุทธิ์ 6xx เทคโนโลยี 7xx ศิลปะและนันทนาการ 8xx วรรณกรรม 9xx ภูมิศาสตร์ประวัติศาสตร์ ส่วนเลขอีก 2 หลักที่เหลือจะเป็นหมวดย่อยของหมวดหลักอีกที เช่น 895 จะหมายถึง หมวดวรรณกรรม (8) หมวดย่อยวรรณกรรมภาษาอื่น ๆ (9) หมวดเล็กวรรณกรรมภาษาเอเชียตะวันออกและตะวันออกเฉียงใต้ (5) ซึ่งก็คือหมวดหนังสือวรรณกรรมภาษาเอเชียตะวันออกและตะวันออกเฉียงใต้ (ไทย จีน ญี่ปุ่น เกาหลี ฯลฯ)

ซึ่งเมื่อวิเคราะห์แนวคิดในการจัดหมวดหนังสือของดิวอี้แล้ว สิ่งแรกที่เห็นทันทีคือ แนวคิดที่มองฝรั่ง (ทั้งยุโรปและอเมริกา) เป็นศูนย์กลางของโลก ส่วนดินแดนของชนชาติอื่น ๆ ถือเป็น "ชายขอบ" หรือ "บริวาร" ที่ไม่มีความสำคัญอะไรมากนัก ดังจะเห็นได้จากหมวด 2xx ศาสนา ที่จัดแบ่งหนังสือศาสนาคริสต์ไว้แบบละเอียดยิบย่อยมาก แต่ศาสนาอื่น ๆ ที่ชาวยุโรปไม่ได้นับถือ โดนยัดไว้ในหมวดย่อย 29x ศาสนาอื่น ๆ หมวดย่อยเดียว!

ยิ่งหมวด 4xx ภาษา และหมวด 8xx วรรณกรรม ยิ่งแลเห็นถึงแนวคิดฝรั่งเป็นศูนย์กลางโลกได้ชัดเจนมาก เพราะยึดเอาภาษาในยุโรปเป็นสำคัญ ส่วนภาษาอื่น ๆ ทั่วโลก โดนเอามาอัดกันไว้อยู่ที่หมวดย่อย 49x หมวดเดียว เช่นเดียวกับ วรรณกรรมภาษาอื่น ๆ ก็เป็น 89x หมวดเดียวเหมือนกัน

ซึ่งเมื่อนำวิธีแบบนี้มาใช้กับห้องสมุดของประเทศที่เป็น "ชายขอบ" ตามแนวคิดของดิวอี้ ก็เลยทำให้เกิดปัญหาขึ้นมาทันที ที่เห็นชัดสุดก็คือหมวด 8xx วรรณกรรมนี่แหละ เพราะสำหรับห้องสมุดไทยบางแห่งแล้ว เอาหมวด 85x วรรณกรรมภาษาอิตาลี 86x วรรณกรรมภาษาสเปน 87x วรรณกรรมภาษาละติน 88x วรรณภาษากรีก มารวมกันหมด 4 หมวดก็ยังไม่แน่ว่าจะมีหนังสือจัดได้เต็มแถวบนชั้นหนังสือหรือเปล่าเพราะวรรณกรรมของประเทศเหล่านี้มีแปลกันน้อยมากในไทย (อิตาลีกับสเปนอาจจะพอมี แต่ละตินกับกรีกนี่ หายากมาก)

ตรงข้ามกับหมวดเล็ก 895 วรรณกรรมภาษาเอเชียตะวันออกและตะวันออกเฉียงใต้ ซึ่งเป็นหมวดเล็กหมวดเดียว แต่จำนวนหนังสือน่าจะเกือบครึ่งของหนังสือทั้งห้องสมุดเลย เพราะแค่นิยายไทยอย่างเดียวก็มหาศาลแล้ว ยังมีนิยายจีนที่คนไทยนิยมอ่านกันมาตั้งแต่พวกกำลังภายในมังกรหยกฤทธิ์มีดสั้น จนถึงยุคนี้ก็ยังมีพวก "มากกว่ารัก" ของแจ่มใสเพิ่มมาอีก เรียกว่าหมวดเล็กหมวดนี้บรรณารักษ์ต้องใส่จุดใส่เลขต่อท้ายกันหลายตัวเลย เพื่อให้พอแยกจากกันได้ จนหลายแห่งถึงกับต้องใช้วิธีแยกเอาหนังสือนวนิยายออกมาเป็นหมวดพิเศษ น. ต่างหาก

สิ่งต่อมาที่เห็นได้ก็คือ การแบ่งหนังสือของดิวอี้นั้นเป็นแนวคิดแบบนักวิชาการยุโรปยุคศตวรรษก่อน ที่ให้ความสำคัญกับวิชาปรัชญามาก จนถึงกับแบ่งออกเป็นหมวดหลัก 1 หมวดเต็ม มีการแบ่งยิบย่อยมากทั้งอภิปรัชญา ญาณวิทยา ปรจิตวิทยา และอีกอย่างคือการรวมเอาเรื่องภูมิศาสตร์กับประวัติศาสตร์ไว้ด้วยกัน พาลทำให้นึกถึงวิชาสังคมสมัยเรียนตอนเด็กที่แบ่งเป็น "ภูมิศาสตร์-ประวัติศาสตร์" กับ "หน้าที่-ศีลธรรม" ยังไงยังงั้นเลย ในขณะที่เรื่องการธุรกิจการค้าถูกมองว่าเป็นงานของ "พ่อค้าหน้าเลือด" (ประมาณเดียวกับไชล็อกในเรื่องเวนิชวานิชเลย) เลยไม่มีหมวดของตัวเอง ต้องไปอาศัยอยู่ในหมวด 3xx สังคมศาสตร์ส่วนหนึ่งในเรื่องของการค้า การขนส่ง และอีกส่วนในเรื่องการจัดการสำนักงาน บัญชี โฆษณาประชาสัมพันธ์ ไปอยู่ในหมวด 6xx เทคโนโลยี

และเมื่อพูดถึงหมวด 6xx แล้ว ก็คงต้องขอบอกว่า น่าจะเปลี่ยนชื่อเป็นหมวด "จับฉ่าย" ให้รู้แล้วรู้รอดไปเลยดีกว่า เพราะมันเหมือนจับฉ่ายจริง ๆ มีทั้งเกษตรกรรม การแพทย์ งานครัวเรือน การจัดการสำนักงาน วิศวกรรม รวมกันในหมวดเดียว!!!! เรียกว่าใครที่เดินเข้าไปดูหนังสือในหมวดนี้ ถ้าไม่ได้ศึกษามาก่อนอาจจะมึนว่า "มันคือหมวดอะไรกันแน่ฟะ" เพราะมองชั้นบนสุดอาจเจอตำราแพทย์ ชั้นถัดมามีการปลูกพืชเลี้ยงสัตว์ อีกชั้นเจอตำราอาหาร การตัดเย็บเสื้อ พอข้ามไปอีกชั้น อ้าว มีสอนการทำบัญชี มองลงมาอีกที เจอหนังสือเกี่ยวกับระเบิดและเชื้อเพลิง ปิดท้ายด้วยวัสดุก่อสร้างเข้าไปอีกต่างหาก แบบนี้จะไม่ให้เรียกว่าจับฉ่ายได้ไงไหว 555555555

ส่วนหมวดย่อย 79x กีฬาและเกม ความจริงก็ไม่ค่อยเข้ากลุ่มกับศิลปะเท่าไหร่ แถมบางทีหนังสือเกมปริศนาก็ยังโดนจัดเข้ามาในหมวดย่อยนี่ด้วย (และบางเล่มก็โดนยัดไว้ที่หมวดจิตวิทยาเฉย) แต่อันนี้คงต้องยกประโยชน์ให้จำเลยไป เพราะหนังสือกีฬามันก็หาหมวดลงได้ยากจริง ๆ แหละ

ท้ายสุดคือ เนื่องจากดิวอี้คิดไว้ตั้งแต่กลางศตวรรษที่ 19 ซึ่งโลกเวลานั้นยังไม่มีอะไรหลายอย่าง เช่น ไม่มีคอมพิวเตอร์ ไม่มียานอวกาศ ไม่มีโทรทัศน์และภาพยนตร์ ฯลฯ พอเมื่อโลกมีของเหล่านี้ขึ้นมา ก็เลยเดือดร้อนต้องหาหมวดลงให้ได้ อย่างเทคโนโลยีด้านอวกาศดีหน่อยเพราะเข้ากับหมวดย่อย 52x ดาราศาสตร์ได้อยู่แล้ว ภาพยนตร์ยุ่งหน่อย ต้องเอาไปยัดไว้ในหมวด 77x การถ่ายภาพ แล้วกล้อมแกล้มเอาว่ามันก็เป็นการถ่ายภาพอย่างหนึ่งเหมือนกัน แต่คอมพิวเตอร์นี่ไม่มีหมวดเก่าให้ลง เลยต้องระเห็ดไปเปิดหมวดใหม่ 00x แทน

ก็คงจะพอแค่นี้ละ ไว้ถ้าเห็นอะไรตรงไหนอีกจะมาเขียนเพิ่ม"""]

for i in range(text.__len__()):
    text[i] = text[i].replace('\n','')

print(text)
sen = [list(word_tokenize(i,engine='newmm')) for i in text]
print(sen)
model = Word2Vec(sen, min_count=1,window=5,sg=1)
ss=model.similar_by_word('โลก',topn=5)
print(ss)



# from gensim.models import Word2Vec
# from pythainlp.tokenize import word_tokenize
# a = ['ฉันรักภาษาไทยเพราะฉันเป็นคนไทยและฉันเป็นคนไทย']
# b = [list(word_tokenize(i)) for i in a] # ทำการตัดคำแล้วเก็บใน list จะได้เป็น [['ฉัน',...],['ฉัน',...]...]
# model = Word2Vec(b, min_count=1)
# print(model)
# aa=model.similar_by_word('เป็น')
# print(aa)